In [16]:
import pandas as pd
import requests

In [20]:
#TODO import CSVs
# http://api.glassdoor.com/api/api.htm?v=1&format=json&t.p=120&t.k=fz6JLNDfgVs&action=employers&q=pharmaceuticals&userip=192.168.43.42&useragent=Mozilla/%2F4.0
housing = pd.read_csv('realtor-data.csv')
housing

careers_url = "web_scrape_top-100-careers.html"
careers_mega = pd.read_html(careers_url)
careers = careers_mega[2]
careers

,0,1,2,3,4
0,Rank,Occupation,# of Jobs,Median Salary,Unemployment Rate
1,1,Dentist,27600,"$142,750",0.7%
2,2,Registered Nurse,712900,"$65,790",2.0%
3,3,Pharmacist,69740,"$113,410",3.2%
4,4,Computer Systems Analyst,120440,"$78,670",2.5%
...,...,...,...,...,...
96,96,Carpenter,196200,"$40,210",16.0%
97,97,Security Guard,195300,"$23,930",11.3%
98,98,Construction Worker,212500,"$29,450",21.2%
99,99,Fabricator,12500,"$35,570",14.3%
100,100,Telemarketer,21500,"$23,570",31.3%

In [11]:
#TODO View Tables
housing = housing.dropna()
housing_by_state = housing.groupby(by='state').mean()
housing_by_state

,price,bed,bath,acre_lot,zip_code,house_size
state,,,,,,
Connecticut,4.619026e+05,3.619000,2.477822,2.229479,6141.558921,2020.612711
Massachusetts,1.048663e+06,3.728019,2.733597,1.249392,1858.009222,2495.452012
New Hampshire,6.540232e+05,3.459059,2.630662,1.628937,3232.766551,2624.074042
New York,8.433816e+05,3.543943,2.603325,15.039382,12309.083135,2345.909739
Puerto Rico,1.100000e+05,7.000000,3.000000,0.090000,949.000000,1192.000000
Rhode Island,4.137837e+05,3.924790,2.265126,0.412395,2883.866387,2229.008403
Vermont,4.696519e+05,3.489712,2.506173,13.748354,5314.049383,2242.991770
Virgin Islands,3.924500e+06,4.500000,5.000000,0.910000,802.000000,4800.000000

In [ ]:
#TODO Merge Tables
    # Table 1 Jobs: Job Title, Location, Salary (Range), (Unemployment)
    # Table 2 Housing: Housing Price, Location, Rooms, Acreage, Sq Ft-age

In [ ]:
#TODO Import into PGAdmin4